# ОПЕРАТОРЫ

# Операторы присваивания
# Название переменных не может начинаться с цифры
a = 1
b = 2
c = 'text'
d = ['some', 'list', a, 777, None, True]    # list

# Арифметические операторы
r1 = a + b      # = 3
r2 = a - b      # = -1
r3 = 2 * 5      # = 10
r4 = 10 / 5     # = 2
r5 = 3 ** 2     # = 9     # Возведение в степень
r6 = 10 // 3    # = 3     # Деление без остатка
r7 = 9 // 3     # = 3
r8 = 5 % 2      # = 1     # Остаток от деления (Деление по модулю)
r9 = 2 % 5      # = 2

# Операторы сравнения
# a == b        Равно               # False
# a > b         Больше              # False
# a < b         Меньше              # True
# a != b        Не равно            # True
# a <= a        Больше или равно    # True

# Логические операторы
# and (и)
# or (или)
# not (не)

# Операторы принадлежности
# in
# not in

# Операторы тождественности
# is
# is not
