
# TODO: Домашнее задание 21.10.22
#  1. Создать в папке 'temp' папку 'dz211022';
#  2. В созданной папке создать три файла с именами 'dz1.py', 'dz2.py', 'dz3.py';
#  3. Реализовать в них функции следующим функционалом:
#       dz1: Запрашивает у пользователя его имя и возраст и печатает их в одну строку;
#       dz2: Запрашивает у пользователя любую строку и печатает колличество пробелов в строке;
#       dz3: Запрашивает любую строку и печатает её в обрамлении специальных символов:
#           1 строка: 30 символов '#' ;
#           2 строка:
#           Полученную от пользователя строку + символы '#' по бокам (можно разное количество),
#           Строка должна быть равной по длине 1-ой и 3-ей строке.
#           Если строка длиннее 1-ой и 3-ей строки, необходимо обрезать пользовательскую
#           строку так, чтобы по краям оставался 1 символ '#' + пробел с каждой стороны;
#           3 строка: 30 символов '#'.
